# if  თუ
# ინდენტაცია
# = არის მინიჭების ოპერატორი
# == ნიშნავს უდრის თუ არა ის ორი ელემენტი ერთმანეთს.
# else -  სხვა შემთხვევაში

name = "nika"

if name == "luka":
    print("True")
else:
    print("False")



age = int(input("რამდენი წლის ხარ?: "))

if age >= 18:
    print("შენ ხარ სრულწლოვანი")
    if age < 40:
        print("შენ ხარ ახალგაზრდა")
    else: 
        print("შენ ხარ პენსიონერი")
else:
    print("შენ არ ხარ სრულწლოვანი")

# > მეტია
# < ნაკლებია 
# == ტოლია
# <= ნაკლებია, ან ტოლია
# >= მეტია, ან ტოლია