# 1) მომხმარებელს input-ის გამოყენებით შემოატანინეთ სახელი, და მომხმარებელი როცა შემოიყვანს თავის სახელს უნდა გამოიტანოს hello მომხმარებელის_სახელი
# 2) მომხმარებელს input-ის გამოყენებით შემოატანინეთ სახელი, გვარი, ასაკი და ქალაქი. როცა  შემოიტანს
# მომხმარებელი ყველაფერს მერე უნდა დაუპრინტოთ გრძელი წინადადება
# 3) კომენტარებით ახსენით რა არის input-ი და output-ი, რამდენიმე მაგალითიც გააკეთეთ input-ებზე
# 4) გაიმეორეთ გავლილი მასალა რაც იცით
  

name = input("Enter your name: ")
lastName = input("Enter your last name: ")
age = int(input("Enter your age: "))
city = input("Enter your city: ")

print("Hello " + name + ".")
print(name + " " + lastName + " is " + str(age) + " years old. He lives in " + city + ".")

#პითონში ჩვენ ვიყენებთ input ფუნქციას, რათა მომხმარებელმა შეძლოს მასში ინფორმაციის ჩაწერა.
#შემდეგ ეს ინფორმაცია ტერმინალში გამოისახება , როგორც output.