# 1)   შექმენით ცვლადი სადაც მიანიჭებთ თქვენს სახელს ეს ცვლადი უნდა დააკომენტაროთ და დაპრინტოთ და ახსნათ კომენტარებით რატომ ვერ გამოიტანს ცვლადის მნიშვნელობას

# my_name = "Dato"
# print(my_name)
# ამ შემთხვევაში my_name ცვლადი არ დაიპრინტება, რადგან კომენტარები მხოლოდ ადამიანებისთვისაა და მათ კომპიუტერი აიგნორებს.


# 2)  ახსენით კომენტარებით რა არის case-sensitive language და გააკეთეთ რამოდენიმე მაგალითიც

name = "Luka"
Name = "Dato"
print(name)
print(Name)

#case-sensitive language არის ისეთი ენა, რომელშიც დიდი მნიშვნელობა ენიჭება დიდ (uppercase) და პატარა (lowercase) ასოებს.
#ამ შემთხვევაში თუ კი გვინდა რომ დაიპრინტოს Luka, უნდა ჩავწეროთ name პატარა ასოთი, რადგან დიდი ასოთი დაიპრინტება სხვა ცვლადი, რომლის value-ც არის Dato.


# 3) შექმენით ცვლადი რომელიც იქნება credit და უნდა შექმნათ კიდე 2 ცვლადი რომელიც იქნება credit დიდი ასოებით და ახსენით კომენტარებით რა განსხვავებაა ამ ცვლადების შორის

credit = 200
CREDIT = 300

print(credit) #output : 200 
print(CREDIT) #output: 300

#ამ ორ ცვლას აქვს ერთნაირი სახელი, მაგრამ ისინი ერთმანეთისგან განსხვავდებიან, რადგან პითონი არის case-sensitive ენა.



# 4) გაიმეორეთ გავლილი მასალა

# 5) გააკეეთ level 5-ის დავალება ვისაც არ გქონდათ გაკეთებული


# 6) შექმენით 2 ცვლადი რომელიც ექნება ერთნაირი სახელები და სხვადახსხვანაირი მნიშვნელობები და და უნდა დაპრინტოთ და ასევე ახსენით კომენტარებით რატომ გამოიტანს პირველ ცვლადს და არა მეორე ცვლადს

color = "red"
Color = "green"
print(Color) #დაიპრინტება მწვანე , რადგან იგი დიდი ასოთი არის დაწერილი. ამ ორ ცვლადს აქვს ერთნაირი სახელი - color ,მაგრამ მათ ერთმანეთისგან განსხვავებული მნიშვნელობები აქვთ, რადგან ერთი არის პატარა ასოთი დაწერილი, მეორე კი დიდი.


# 7) სიტყვები:
# Declare - რაღაცის შექმნა/დეკლარაცია
# Case-sensitive - ქეის სენსიტიური
# Ignore - იგნორირება
# Comment - კომენტარი 


#8) გააკეთეთ 1500 ერორი და გადმოიწერეთ ეს extension ვისაც არ გაქვთ გადმოწერილი

#7000 შეცდომამდე ავედი, მაგრამ განსხვავებული სახე მაინც არ გამოჩნდა.

