# 1) მომხმარებელს input-ის გამოყენებით უნდა შემოატანინოთ მონაცემთა ტიპი და შემდეგ უნდა დაპრინტოთ მომხმარებლის შეტანილი მონაცემთა ტიპი example: თუ მომხმარებელმა შემოიტანა string-ი მაშინ უნდა გამოიტანოს <class string>

data_type = input("Enter any data type: ")
print(type(data_type))


# 2) შექმენით ცვლადი სადაც შეიტანთ string-ს და უნდა დაპრინტოთ ცვლადის მონაცემთა ტიპი
name = "Dato"
print(type(name))

# 3) შექმენით ცვლადი სადაც შეიტანთ string-ს და ეს სტრინგი უნდა გადააქციოთ ინტეჯერად და უნდა ახსნათ კომენტარებით რატო არ შეიძლება რომ ეს string-ი გადავაქციოთ ინტეჯერად

color = "Red"
# print(int(color))

#ამ შემთხვევაში ცვლადს სახელად color ვერ გადავაქცევთ ინტეჯერად, რადგან მასზე მათემატიკური ოპერაციების / მოქმედებების ჩატარება შეუძლებელია.



# 4) ახსენით type ფუნქცია რას აკეთებს კომენტარებით და გააკეთეთ მაგალითებიც

#type ფუნქცია გვიჩვენებს იმ item-ის დატა ტიპს, რომელსაც ჩავწერთ ამ ფუნქიიცს ბრჩხილებში, მაგალითად:

print(type("Hello"))   # <class 'str'>

number = 123
print(type(number))    # <class 'int'>

number2 = 10.6
print(type(number2))   # <class 'float'>

a = 6
b = 3
c = 6/3
print(type(c))   # <class 'float'>


# 5) გატესტეთ და ეს კოდი ახსენით კომენტარებით რას აკეთებს 

num1 = "10"
num2 = "10"
print(int(num1) + int(num2))



