# 5) გატესტეთ და ეს კოდი ახსენით კომენტარებით რას აკეთებს 

num1 = "10"
num2 = "10"
print(int(num1) + int(num2))

# ამ მაგალითში გვაქვს მოცემული 2 ცვლადი, რომელთა მნიშვნელობებია სტრინგები. შემდეგ print ფუნქციაში ჩვენ ამ სტრინგებს ვაქცევთ ინტეჯერებად და ვუმატებთ ერთმანეთს. რადგანაც ამ ცვლადების მნიშვნელობები იყო რიცხვები, მათი ინტეჯერებად გადაქცევა შესაძლებელი იყო, რის შემდეგაც ისინი ერთმანეთს მივუმატეთ და output-ად მივიღეთ 20.




# 6) ახსენით კომენტარებით რას ნიშნავს string, integer, float და გააკეთეთ რამოდენიმე მაგალითიც

#string არის data type. ყველაფერი რაც ბრჭყალებში არის მოქცეული, არის სტრინგი.
#integer არის data type, რიცხვები, რომლებიც იწერება ბრჭყალების გარეშე და რომელზეც შესაძლებელია ჩავატაროთ მათემატიკური ოპერაციები (მიმატება,  გამოკლება, გამრავლება, გაყოფა და ა.შ.)
#float არის data type, ათწილადი (10.5 ; 12.3 ; 532.8).

item = "pen"
print(type(item))   # <class 'str'>

number1 = 130
print(type(number1))  # <class 'int">

number2 = 12.8
print(type(number2))  # <class 'float'>

# 7) გააკეთეთ 1500 ერორი ვისაც არ გქონდათ გაკეთებული
